tutorials/untested/BulbPimple2/constant/reactiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Dictionary for right hand side of thermDCRRhoPorousSimpleFOAM

/* 
    Prepared kinetics setup:
        1) CO oxidation -- inhibition kinetics accroding to 3D reconstruction and pore-scale modeling of coated catalytic filters for automotive exhaust gas aftertreatment (Koci 17)
        2) general power law kinetics -- r = \Pi_{\all i} k*c_i^alpha_i
        ==> switch using kinSetupSwitch 1 or 2
*/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reactProps
{
    // -- list of switches for reactions on/off
    activeReacts    (0 1);                                          
    
    // -- CO oxidation
    reaction00{
        kinSetupSwitch 1;                       // -- special kinetics for CO oxidation
        k0  k0  [0 -3 -1 0 1 0 0]   7.84e16;
        sHr sHr [1 2 -2 0 -1 0 0]   -283e3;	
        EA	EA	[1  2 -2 0 -1 0 0]  90000.0;
        kin	kin	[0 0 0 0 0 0 0]		80;
        Ein	Ein	[0 0 0 1 0 0 0]		1000;
    }

    // -- first order CO reaction
    reaction01{
        kinSetupSwitch 2;                       // -- general power law kinetics
    //    k0  k0  [0 0 -1 0 0 0 0]   1132250.6;
    //    k0  k0  [0 0 -1 0 0 0 0]   500000;
    //    k0  k0  [0 0 -1 0 0 0 0]   55000; // zona1
    //   k0  k0  [0 0 -1 0 0 0 0]   61200; // zona2
		k0  k0  [0 0 -1 0 0 0 0]   60500; // thisline
        k0  k0  [0 0 -1 0 0 0 0]   0.0;
//        sHr sHr [1 2 -2 0 -1 0 0]   0;
         sHr sHr [1 2 -2 0 -1 0 0]   -245274;	
        EA	EA	[1  2 -2 0 -1 0 0]   51611.2;
    }
    
    // -- numerical properties for gradients
    numProps
    {
        clipGradMin     -1e10;
        clipGradMax     1e10;
    }
}

// ************************************************************************* //
