tutorials/untested/BulbPimple2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 0.0 0.0 )	// 000
	 ( 0.1 0.0 0.0 )	// 001
	 ( 0.1 0.01 0.0 )	// 002
	 ( 0.0 0.01 0.0 )	// 003
	 ( 0.0 0.0 0.0003 )	// 004
	 ( 0.1 0.0 0.0003 )	// 005
	 ( 0.1 0.01 0.0003 )	// 006
	 ( 0.0 0.01 0.0003 )	// 007
	 ( 0.1 0.5098692642890594 0.0 )	// 008
	 ( 0.0 0.5098692642890594 0.0 )	// 009
	 ( 0.1 0.5098692642890594 0.0003 )	// 010
	 ( 0.0 0.5098692642890594 0.0003 )	// 011
	 ( 0.1859 0.0 0.0 )	// 012
	 ( 0.1859 0.01 0.0 )	// 013
	 ( 0.1859 0.0 0.0003 )	// 014
	 ( 0.1859 0.01 0.0003 )	// 015
	 ( 0.28590000000000004 0.0 0.0 )	// 016
	 ( 0.28590000000000004 0.01 0.0 )	// 017
	 ( 0.28590000000000004 0.0 0.0003 )	// 018
	 ( 0.28590000000000004 0.01 0.0003 )	// 019
	 ( 0.28590000000000004 0.5098692642890594 0.0 )	// 020
	 ( 0.1859 0.5098692642890594 0.0 )	// 021
	 ( 0.28590000000000004 0.5098692642890594 0.0003 )	// 022
	 ( 0.1859 0.5098692642890594 0.0003 )	// 023
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 11  33  1)	simpleGrading 	( 0.0333333  1.0  1.0)

	hex
		( 3  2  8  9  7  6  10  11)	( 11  56  1)	simpleGrading 	( 0.0333333  30  1.0)

	hex
		( 1  12  13  2  5  14  15  6)	( 286  33  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 12  16  17  13  14  18  19  15)	( 11  33  1)	simpleGrading 	( 30  1.0  1.0)

	hex
		( 13  17  20  21  15  19  22  23)	( 11  56  1)	simpleGrading 	( 30  30  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 3  2  8  9)
			( 7  6  10  11)
			( 1  12  13  2)
			( 5  14  15  6)
			( 12  16  17  13)
			( 14  18  19  15)
			( 13  17  20  21)
			( 15  19  22  23)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 0  3  7  4)
			( 0  1  5  4)
			( 3  9  11  7)
			( 9  8  10  11)
			( 2  8  10  6)
			( 1  12  14  5)
			( 2  13  15  6)
			( 12  16  18  14)
			( 16  17  19  18)
			( 17  20  22  19)
			( 13  21  23  15)
			( 21  20  22  23)
		);
	}

); 

mergePatchPairs 
( 
); 

