tutorials/untested/BulbPimple2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingHetCatSimpleFoamMSM;
// application     customSolver;

startFrom       latestTime;
startFrom       startTime;

startTime 	    0;

stopAt          endTime;
// stopAt          writeNow;

endTime	       36000;  //endlineLine

deltaT          1e-5;

writeControl    adjustableRunTime;
// writeControl    timeStep;

writeInterval	       10;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.1;


// ************************************************************************* //

functions
{
      #include "residuals"
}
