tutorials/untested/BulbPimple2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|Phi)"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            relTol          0.01;
            smoother        symGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            processorAgglomerator   procFaces;
            nAgglomeratingCells     10;
            mergeLevels             1;
        }
        tolerance       1e-08;
        relTol          0.01;
    }
    "(pFinal|PhiFinal)"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            // relTol          0.01;
            smoother        symGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            processorAgglomerator   procFaces;
            nAgglomeratingCells     10;
            mergeLevels             1;
        }
        tolerance       1e-08;
        // relTol          0.01;
    }

    "(U)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.01;
    }
    "(UFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        // relTol          0.01;
    }

    "T"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }
    
    "(h|k|omega|epsilon)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.05;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration      on;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        processorAgglomerator   procFaces;
        nAgglomeratingCells     400;
        mergeLevels             1;
    }
    
    "(CO|O2|CO2Mass|N2O|N2|NO|ethylene|methanol|acetone|prod|methanolMass|acetoneMass|prodMass|N2Mass|H2Mass|rho|rhoFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }  
    "(methanolMassFinal|CO2MassFinal|acetoneMassFinal|prodMassFinal|N2MassFinal|H2MassFinal|rhoFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        // relTol          0.01;
    }  

}

SIMPLE
{
    nUCorrectors 0;            
    nConcCorrectors 1;              // n of concentration calculations for each specie
    nTempCorrectors 0;	            // n of temperature corrections 
    nTogCorrectors 0;	            // n of temperature corrections 
    nNonOrthogonalCorrectors 0;     // n of presure corrections (not necessary on this mesh)

    debug 2;
    consistent yes;
    
    residualControl
    {
        p           1e-4;
        // U           5e-5;
        T           1e-5;
        prod           1.5e-4;
        ethylene           1.5e-4;
        // "(CO|NO|O2|N2O|CO2)"    5e-4;
    }
}

PIMPLE
{
    nUCorrectors 0;     
    nOuterCorrectors 1;       
    nConcCorrectors 1;              // n of concentration calculations for each specie
    nTempCorrectors 0;	            // n of temperature corrections 
    nTogCorrectors 0;	            // n of temperature corrections 
    nNonOrthogonalCorrectors 1;     // n of presure corrections (not necessary on this mesh)

    debug 2;
    consistent yes;
    
    // residualControl
    // {
    //     p           1e-4;
    //     // U           5e-5;
    //     T           1e-5;
    //     prod           1.5e-4;
    //     ethylene           1.5e-4;
    //     // "(CO|NO|O2|N2O|CO2)"    5e-4;
    // }
}

relaxationFactors
{
    fields
    {
        // p           0.1;
        // U           0.1;
        // T           0.5;
        // "(ethylene|CO|O2|CO2|methanol|acetone)" 	 0.5;
        //  "(ethylene|prod|CO|O2|CO2)" 	 0.1;
    }
    // equations
    // {
    //     "(p|U)" 0.95;
    //     "(T)" 0.98;
    //     // "(ethylene|CO|O2|CO2|methanolMass|acetoneMass)" 	 0.999;
    //     "(ethylene|CO|O2|CO2|methanolMass|acetoneMass|N2Mass|H2Mass)" 	 0.995;
    // }
}
// ************************************************************************* //
