tutorials/untested/BulbPimple2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// defaultFieldValues
// (
//     volScalarFieldValue T 300
// );

regions
(
    // Set patch values (using ==)
    boxToCell
    {
        box (0.1429 -1 -10) (1 1 10);

        fieldValues
        (
            volScalarFieldValue H2Mass 0.06821646
            volScalarFieldValue CO2Mass 0
            volScalarFieldValue N2Mass 0.93178354
        );
    }
);